docs/MethodInvokerService.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="MethodInvokerService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://tempuri.org/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Soneta.Net.Types"/><xs:element name="InvokeServiceMethod"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="invokerParams" nillable="true" type="q1:ServiceMethodInvokerParams" xmlns:q1="http://schemas.datacontract.org/2004/07/Soneta.Net.Types"/></xs:sequence></xs:complexType></xs:element><xs:element name="InvokeServiceMethodResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="InvokeServiceMethodResult" nillable="true" type="q2:InvokeServiceMethodResult" xmlns:q2="http://schemas.datacontract.org/2004/07/Soneta.Net.Types"/></xs:sequence></xs:complexType></xs:element><xs:element name="InvokeServiceMethodJson"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="invokerParams" nillable="true" type="q3:ServiceMethodInvokerParams" xmlns:q3="http://schemas.datacontract.org/2004/07/Soneta.Net.Types"/></xs:sequence></xs:complexType></xs:element><xs:element name="InvokeServiceMethodJsonResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="InvokeServiceMethodJsonResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Soneta.Net.Types" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Soneta.Net.Types"><xs:import namespace="http://schemas.datacontract.org/2004/07/Soneta.Types"/><xs:complexType name="ServiceMethodInvokerParams"><xs:complexContent mixed="false"><xs:extension base="q1:InternalServiceMethodInvokerParams" xmlns:q1="http://schemas.datacontract.org/2004/07/Soneta.Types"><xs:sequence><xs:element minOccurs="0" name="ConnectionInfo" nillable="true" type="tns:ConnectionInfo"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType><xs:element name="ServiceMethodInvokerParams" nillable="true" type="tns:ServiceMethodInvokerParams"/><xs:complexType name="ConnectionInfo"><xs:sequence><xs:element minOccurs="0" name="Database" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Operator" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Password" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Server" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ServerType" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ConnectionInfo" nillable="true" type="tns:ConnectionInfo"/><xs:complexType name="InvokeServiceMethodResult"><xs:sequence><xs:element minOccurs="0" name="ExceptionMessage" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="IsEmpty" type="xs:boolean"/><xs:element minOccurs="0" name="IsException" type="xs:boolean"/><xs:element minOccurs="0" name="ResultInstance" nillable="true" type="xs:anyType"/></xs:sequence></xs:complexType><xs:element name="InvokeServiceMethodResult" nillable="true" type="tns:InvokeServiceMethodResult"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Soneta.Types" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Soneta.Types"><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:complexType name="InternalServiceMethodInvokerParams"><xs:sequence><xs:element minOccurs="0" name="ClientAddress" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ContextHandle" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DatabaseHandle" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="IpFilters" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="MethodArgs" nillable="true" type="q1:ArrayOfKeyValueOfstringanyType" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:element minOccurs="0" name="MethodName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Operator" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Password" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ServiceName" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="InternalServiceMethodInvokerParams" nillable="true" type="tns:InternalServiceMethodInvokerParams"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><xs:complexType name="ArrayOfKeyValueOfstringanyType"><xs:annotation><xs:appinfo><IsDictionary xmlns="http://schemas.microsoft.com/2003/10/Serialization/">true</IsDictionary></xs:appinfo></xs:annotation><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="KeyValueOfstringanyType"><xs:complexType><xs:sequence><xs:element name="Key" nillable="true" type="xs:string"/><xs:element name="Value" nillable="true" type="xs:anyType"/></xs:sequence></xs:complexType></xs:element></xs:sequence></xs:complexType><xs:element name="ArrayOfKeyValueOfstringanyType" nillable="true" type="tns:ArrayOfKeyValueOfstringanyType"/></xs:schema></wsdl:types><wsdl:message name="IMethodInvokerService_InvokeServiceMethod_InputMessage"><wsdl:part name="parameters" element="tns:InvokeServiceMethod"/></wsdl:message><wsdl:message name="IMethodInvokerService_InvokeServiceMethod_OutputMessage"><wsdl:part name="parameters" element="tns:InvokeServiceMethodResponse"/></wsdl:message><wsdl:message name="IMethodInvokerService_InvokeServiceMethodJson_InputMessage"><wsdl:part name="parameters" element="tns:InvokeServiceMethodJson"/></wsdl:message><wsdl:message name="IMethodInvokerService_InvokeServiceMethodJson_OutputMessage"><wsdl:part name="parameters" element="tns:InvokeServiceMethodJsonResponse"/></wsdl:message><wsdl:portType name="IMethodInvokerService"><wsdl:operation name="InvokeServiceMethod"><wsdl:input wsaw:Action="http://tempuri.org/IMethodInvokerService/InvokeServiceMethod" message="tns:IMethodInvokerService_InvokeServiceMethod_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMethodInvokerService/InvokeServiceMethodResponse" message="tns:IMethodInvokerService_InvokeServiceMethod_OutputMessage"/></wsdl:operation><wsdl:operation name="InvokeServiceMethodJson"><wsdl:input wsaw:Action="http://tempuri.org/IMethodInvokerService/InvokeServiceMethodJson" message="tns:IMethodInvokerService_InvokeServiceMethodJson_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMethodInvokerService/InvokeServiceMethodJsonResponse" message="tns:IMethodInvokerService_InvokeServiceMethodJson_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IMethodInvokerService" type="tns:IMethodInvokerService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="InvokeServiceMethod"><soap:operation soapAction="http://tempuri.org/IMethodInvokerService/InvokeServiceMethod" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="InvokeServiceMethodJson"><soap:operation soapAction="http://tempuri.org/IMethodInvokerService/InvokeServiceMethodJson" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="MethodInvokerService"><wsdl:port name="BasicHttpBinding_IMethodInvokerService" binding="tns:BasicHttpBinding_IMethodInvokerService"><soap:address location="http://89.25.231.229:19444/Business/MethodInvokerService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>